---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResultArray.Item(System.Int32)
source: html/1bdc6b95-ac08-92a7-4a4d-b6b709f94b47.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual IntersectionResult this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.